       IDENTIFICATION DIVISION.
       PROGRAM-ID. OPERACIONES-ARITMETICAS.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

        01 NUMERO1 PIC 9(2) VALUE 15.
        01 NUMERO2 PIC 9(2) VALUE 7.

        01 RESULTADO PIC 9(3)V99 VALUE 0.
        01 SUMA PIC 9(2) VALUE 0.
        01 RESTA PIC 9(2) VALUE 0.
        01 MULTIPLICACION PIC 9(3) VALUE 0.
        01 DIVISIONES PIC 9(2)V99 VALUE 0.


       PROCEDURE DIVISION.
       OPERACION.
          COMPUTE RESULTADO = NUMERO1 / NUMERO2.
          ADD NUMERO1 TO NUMERO2 GIVING SUMA.
          SUBTRACT NUMERO1 FROM NUMERO2 GIVING RESTA.
          MULTIPLY NUMERO1 BY NUMERO2 GIVING MULTIPLICACION.
          DIVIDE NUMERO1 BY NUMERO2 GIVING DIVISIONES.
       DA-RESULTADO.
          DISPLAY "El resultado es " RESULTADO.
          DISPLAY "La suma es: " SUMA.
          DISPLAY "La resta es: " RESTA.
          DISPLAY "La multiplicacion es: " MULTIPLICACION.
          DISPLAY "La division es: " DIVISIONES.
       STOP RUN.

       END PROGRAM OPERACIONES-ARITMETICAS.
