
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONTROL-DE-FLUJO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM CONTROL-DE-FLUJO.
