       IDENTIFICATION DIVISION.
       PROGRAM-ID. REASIGNACION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 NOMBRE PIC A(25) VALUE SPACES.
       PROCEDURE DIVISION.
       DISPLAY NOMBRE.
       MOVE "EDUARDO" TO NOMBRE.
       DISPLAY NOMBRE

            STOP RUN.
       END PROGRAM REASIGNACION.
